/*1. Если переменная a равна '1' и по значению и по типу, то выведите 'Верно', иначе
выведите 'Неверно'.
Проверьте работу скрипта при a, равном '1', 1, 3.*/

let a  = '1';

if (a === '1'){
    console.log('Верно')
}else{
    console.log('Неверно')
}


/*2. Если переменная item не равна true, то выведите 'Верно', иначе выведите 'Неверно'.
Проверьте работу
скрипта при item, равном true, false. Напишите два варианта скрипта - с короткой записью
и с длинной.*/


/*3. Если переменная a больше нуля и меньше 4-ти, то выведите 'Верно', иначе выведите
'Неверно.
Проверьте работу скрипта при a, равном 4, 0, -3, 2.*/


/*4. Если переменная a больше 3-х и меньше 12-ти, или переменная b больше или равна 7-
и и меньше 15-ти, то выведите 'Верно', в противном случае выведите 'Неверно'.*/


/*5. В переменной month лежит какое-то число из интервала от 1 до 12. Определите в какую
пору года попадает этот месяц (зима, лето, весна, осень).*/


/*6. Выведите в консоли столбец четных чисел в промежутке от 0 до 100. (используя for или
while)*/