'use strict';

/*1. Если переменная a равна '1' и по значению и по типу, то выведите 'Верно, иначе
выведите 'Неверно.
Проверьте работу скрипта при a, равном '1', 1, 3.*/

let a = '1';

if( a === '1' ){
    console.log( 'Верно');
}else{
    console.log( 'Не верно');
}

/*2. Если переменная item не равна true, то выведите 'Верно', иначе выведите 'Неверно'.
Проверьте работу скрипта при item, равном true, false. Напишите два варианта скрипта - с короткой записью
и с длинной.*/

let item = true;

if( item != true){
    console.log( 'Верно');
}else{
    console.log( 'Не верно');
}

item = ( item != true) ? 'Верно' : 'Не верно';

console.log(item);

/*3. Если переменная a больше нуля и меньше 4-ти, то выведите 'Верно', иначе выведите
'Неверно'. Проверьте работу скрипта при a, равном 4, 0, -3, 2.*/

let a1 = 2;

    a1 = ( a1 > 0 && a1 < 4) ? 'Верно' : 'Не верно'; 

console.log(a1);

/*4. Если переменная a больше 3-х и меньше 12-ти, или переменная b больше или равна 7-
и и меньше 15-ти, то выведите 'Верно', в противном случае выведите 'Неверно'.*/

let a2 = 2;

    a2 = ( a2 > 3 && a2 < 12) ? 'Верно' : 'Не верно'; 

console.log(a2);

let b1 = 7;

    b1 = ( b1 >= 7 && b1 < 15) ? 'Верно' : 'Не верно'; 

console.log(b1);

/*5. В переменной month лежит какое-то число из интервала от 1 до 12. Определите в какую
пору года попадает этот месяц (зима, лето, весна, осень).*/

let month = 6;

if((month == 12) || (month == 2) || (month == 2)){
    console.log('Зима');
}else if((month == 3) || (month == 4) || (month == 5)){
    console.log('Весна');
}else if((month == 6) || (month == 7) || (month == 8)){
    console.log('Лето');
}else if((month == 9) || (month == 10) || (month == 11)){
    console.log('Осень');
}else{
    console.log('Нет такого времени года')
};

//6. Выведите в консоли столбец четных чисел в промежутке от 0 до 100. (используя for или while)

for(let i = 2; i <= 100; i++){
    if( i % 2 == 0 )
    
    console.log(i);
}

